Repository: yezhihua419-beep/ZenFocus
Catalog: src/ChanJing.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# Shield_CatLabel
source: {0} ({1} sites)
zh_cn: {0}（{1}站）

# Shield_LoadFail
source: Page failed to load: {0}
zh_cn: 页面加载异常：{0}

# Shield_FreeDomainLimit
source: Free version: up to {0} custom domains. Activate for unlimited. Categories are open.
zh_cn: 免费版自定义域名最多 {0} 个，激活后不限。分类屏蔽全开放。

# Shield_AddFail
source: Add failed: {0}
zh_cn: 添加失败：{0}

# Shield_AddLimitFail
source: Failed to add limit: {0}
zh_cn: 添加限额失败：{0}

# Shield_NoAllow
source: No temporary allows
zh_cn: 当前无临时放行

# Shield_AllowUntil
source: {0} (until {1:HH:mm})
zh_cn: {0}（至 {1:HH:mm}）

# Shield_SaveFail
source: Save failed: {0}
zh_cn: 保存失败：{0}

# Shield_ClearTitle
source: Clear all rules?
zh_cn: 确认清除

# Shield_ClearContent
source: This clears saved categories and custom domains. Cannot undo. Continue?
zh_cn: 将清除已保存的屏蔽分类和自定义域名，不可撤销。继续？

# Shield_ClearPrimary
source: Clear
zh_cn: 确认清除

# Shield_Cleared
source: All block rules cleared (scene presets kept; reset a scene from home via right-click).
zh_cn: 所有屏蔽配置已清除（场景配置保留，可在首页右键场景单独重置）。

# Shield_ClearFail
source: Clear failed: {0}
zh_cn: 清除失败：{0}

# Shield_Cleaned
source: Checked and cleaned ZenFocus hosts markers.
zh_cn: 已检查并清理禅净的 hosts 标记段。

# Shield_CleanFail
source: Cleanup failed: {0}
zh_cn: 清理失败：{0}。

# Shield_NeedProc
source: Enter a process name, e.g. Douyin.
zh_cn: 请输入进程名，如 Douyin。

# Shield_KillTitle
source: Kill-process mode
zh_cn: 结束进程模式

# Shield_KillContent
source: This will force-close blocked apps. Unsaved work may be lost.\n\nUse this mode?
zh_cn: 结束进程会强制关闭被拦应用，未保存内容可能丢失。\n\n使用此模式？

# Shield_KillPrimary
source: Use it
zh_cn: 确认使用

# Shield_Applied
source: Config saved ({0} domains). Websites apply when focus starts.
zh_cn: 配置已保存（{0} 个域名）。网站在开始专注后生效。

# Shield_NotApplied
source: Not saved ({0} domains selected — tap Save config)
zh_cn: 未配置（已选 {0} 个域名，点击「保存配置」）

# Shield_Exported
source: Config exported to: {0}
zh_cn: 配置已导出到：{0}

# Shield_ExportFail
source: Export failed: {0}
zh_cn: 导出失败：{0}

# Shield_Imported
source: Config imported. Tap Save config; it applies when focus starts.
zh_cn: 配置已导入，点击「保存配置」，开始专注时自动生效。

# Shield_ImportFail
source: Import failed: {0}
zh_cn: 导入失败：{0}

# Shield_AllowPlaceholder
source: Domain, e.g. example.com
zh_cn: 域名如 example.com

# FeedbackMail_Subject
source: ZenFocus feedback - v{0}
zh_cn: 禅净反馈 - v{0}

# FeedbackMail_Body
source: Version: {0}\nOS: {1}\n\nDescribe the issue or suggestion:\n
zh_cn: 版本：{0}\n系统：{1}\n\n请描述您遇到的问题或建议：\n

# Elevated_Apply
source: Blocking applied.
zh_cn: 屏蔽已应用。

# Elevated_Remove
source: Blocking removed.
zh_cn: 屏蔽已撤销。

# Elevated_Cleanup
source: ZenFocus hosts markers cleaned.
zh_cn: 已清理禅净的 hosts 标记段。

# Elevated_Fail
source: Failed: {0}
zh_cn: 未能完成：{0}

# Allow_Session
source: this session
zh_cn: 本次专注期间

# Allow_Minutes
source: {0} min
zh_cn: {0}分钟

# Balloon_Limit
source: "{0}" hit today's limit. Take a break.
zh_cn: 「{0}」已达今日限额，休息一下吧。

# Balloon_LimitTitle
source: ZenFocus · Daily limit
zh_cn: 禅净 · 每日限额

# Balloon_Dist
source: You opened "{0}". Breathe, return to the work.
zh_cn: 你打开了「{0}」。深呼吸，回到眼前的事。

# Balloon_DistTitle
source: ZenFocus · Distraction
zh_cn: 禅净 · 分心提醒

# Balloon_Coding
source: You've been coding in "{0}" for 2 min. Consider starting focus. ({1}/3, then switch to Work wish/time)
zh_cn: 检测到你在「{0}」中持续编码2分钟了，建议开启专注。（第{1}/3次，之后切换工作愿望/时长，不改屏蔽分类）

# Balloon_CodingTitle
source: ZenFocus · Scene tip
zh_cn: 禅净 · 场景推荐

# Balloon_Kill
source: "{0}" is {1}. It will be closed in 3 seconds — save now.
zh_cn: 「{0}」属于{1}，3秒后将强制结束，请尽快保存。

# Balloon_AppTitle
source: ZenFocus · App block
zh_cn: 禅净 · 桌面应用拦截

# Balloon_Min
source: "{0}" is {1}. Minimized.
zh_cn: 「{0}」属于{1}，已自动最小化。

# StatsPage_InsightDefault.Text
source: Today's insight appears after your first session
zh_cn: 完成第一次专注后，这里会出现今日洞察

# StatsPage_TodayCountLabel.Text
source: Sessions
zh_cn: 今日次数

# StatsPage_TodayMinutesLabel.Text
source: Minutes
zh_cn: 今日分钟

# StatsPage_StreakLabel.Text
source: Streak
zh_cn: 连续天数

# StatsPage_DistractionLabel.Text
source: Distractions
zh_cn: 分心次数

# StatsPage_QualityLabel.Text
source: Quality
zh_cn: 质量分

# StatsPage_ShareCard.Content
source: Share card
zh_cn: 分享卡片

# StatsPage_PeakHourTitle.Text
source: Peak hours
zh_cn: 高效时段

# StatsPage_StreakHistoryTitle.Text
source: Streak history
zh_cn: 连续纪录

# StatsPage_EmptyHint.Text
source: No sessions yet. Start your first focus on the Focus page.
zh_cn: 还没有专注记录。回到「禅定」页开始第一次定心。

# StatsPage_ChartExpander.Text
source: Charts
zh_cn: 详细图表

# StatsPage_WeekTitle.Text
source: Last 7 days
zh_cn: 近 7 天

# StatsPage_HourTitle.Text
source: Today by hour
zh_cn: 今日时段

# StatsPage_MonthTitle.Text
source: This month
zh_cn: 本月热力

# StatsPage_DistractionSourcesTitle.Text
source: Top distractions
zh_cn: 分心来源

# StatsPage_UsageTitle.Text
source: Today's usage
zh_cn: 今日使用

# StatsPage_ShareZenChar.Text
source: Zen
zh_cn: 定

# StatsPage_ShareTitle.Text
source: Today's focus
zh_cn: 今日定心

# StatsPage_ShareCountUnit.Text
source: sessions
zh_cn: 次

# StatsPage_ShareMinutesUnit.Text
source: minutes
zh_cn: 分钟

# StatsPage_ShareStreakUnit.Text
source: streak
zh_cn: 连续

# StatsPage_ShareQualityUnit.Text
source: quality
zh_cn: 质量

# Stats_InsightHas
source: Focused {0} min today · {1} sessions · keep going
zh_cn: 今日已专注 {0} 分钟 · 完成 {1} 次定心 · 继续保持

# Stats_InsightEmpty
source: No sessions today · start the first one on Focus
zh_cn: 今日还没有专注记录 · 回到「禅定」页开始第一次定心

# Stats_PeriodDawn
source: early morning
zh_cn: 清晨

# Stats_PeriodMorning
source: morning
zh_cn: 上午

# Stats_PeriodNoon
source: midday
zh_cn: 午间

# Stats_PeriodAfternoon
source: afternoon
zh_cn: 下午

# Stats_PeriodEvening
source: evening
zh_cn: 晚间

# Stats_PeriodNight
source: late night
zh_cn: 深夜

# Stats_Pattern
source: You move most in the {0} (around {1}:00). {2}% of last-7-day activity is in this window. Add a daily limit on the Block page if needed.
zh_cn: 观察：你在{0}（{1}点前后）最容易起身活动，近7天{2}%的活动集中在这个时段。可在屏蔽页为此时段加设每日限额。

# Stats_Weekday1
source: Mon
zh_cn: 一

# Stats_Weekday2
source: Tue
zh_cn: 二

# Stats_Weekday3
source: Wed
zh_cn: 三

# Stats_Weekday4
source: Thu
zh_cn: 四

# Stats_Weekday5
source: Fri
zh_cn: 五

# Stats_Weekday6
source: Sat
zh_cn: 六

# Stats_Weekday7
source: Sun
zh_cn: 日

# Stats_DayTip
source: {0}/{1}: {2} min
zh_cn: {0}月{1}日：{2} 分钟

# Stats_UsageDist
source: {0} (distraction)
zh_cn: {0}（分心）

# Stats_UsageMin
source: {0} min
zh_cn: {0} 分

# Stats_DistNone
source: No distractions in 7 days. Steady.
zh_cn: 近7天没有分心记录，定心状态很好

# Stats_ExportCsv
source: CSV
zh_cn: CSV 表格

# Stats_ExportJson
source: JSON
zh_cn: JSON 数据

# Stats_ExportName
source: ZenFocus_{0:yyyyMMdd}
zh_cn: 禅净专注数据_{0:yyyyMMdd}

# Stats_CsvHeader
source: Started,Ended,Planned min,Actual min,State,Intention,Distractions,Top sources,ADHD
zh_cn: 开始时间,结束时间,计划分钟,实际分钟,状态,今日一愿,分心次数,分心来源TOP3,ADHD

# Stats_StateDone
source: Completed
zh_cn: 圆满结束

# Stats_StateBroken
source: Broken
zh_cn: 破功

# Stats_StateRunning
source: In progress
zh_cn: 进行中

# Stats_Yes
source: Yes
zh_cn: 是

# Stats_No
source: No
zh_cn: 否

# Stats_ShareDlgTitle
source: Today's focus card
zh_cn: 今日定心卡片

# Stats_ShareSave
source: Save image
zh_cn: 保存图片

# Stats_ShareSaved
source: Saved to:\n{0}\nCopied to clipboard — paste to share.
zh_cn: 卡片已保存到：\n{0}\n且已复制到剪贴板，可直接粘贴分享。

# Stats_ShareFail
source: Save failed
zh_cn: 保存失败

# Stats_PeakEmpty
source: No sessions in 30 days
zh_cn: 近30天暂无专注记录

# Stats_PeakMorning
source: 6am–12pm
zh_cn: 上午6-12点

# Stats_PeakAfternoon
source: 12–6pm
zh_cn: 下午12-18点

# Stats_PeakEvening
source: 6pm–12am
zh_cn: 晚上18-24点

# Stats_PeakNight
source: 12–6am
zh_cn: 凌晨0-6点

# Stats_PeakText
source: Most focused in {0}: {1} min in 30 days ({2}%). Schedule important work then.
zh_cn: 你在{0}最专注，近30天共{1}分钟（占{2}%）。建议把重要工作安排在这个时段。

# Stats_PeakFail
source: Peak-hour analysis unavailable
zh_cn: 时段分析暂不可用

# Stats_StreakEmpty
source: No streak yet
zh_cn: 暂无专注纪录

# Stats_StreakText
source: Current {0} days · best {1} days · {2} days this month
zh_cn: 当前连续{0}天 · 最长连续{1}天 · 本月专注{2}天

# Stats_StreakFail
source: Streak stats unavailable
zh_cn: 纪录统计暂不可用

# Stats_Quote0
source: A journey of a thousand miles begins with a single step.
zh_cn: 不积跬步，无以至千里。

# Stats_Quote1
source: Where the heart goes, the feet follow.
zh_cn: 心之所向，素履以往。

# Stats_Quote2
source: Small daily work compounds.
zh_cn: 日拱一卒，功不唐捐。

# Stats_Quote3
source: Still water runs deep. Focus travels far.
zh_cn: 静水流深，专注致远。

# Stats_Quote4
source: What you keep in mind returns.
zh_cn: 念念不忘，必有回响。

# Stats_Quote5
source: The longest path starts under your feet.
zh_cn: 千里之行，始于足下。

# Stats_Quote6
source: Those who love the work go farther than those who merely know it.
zh_cn: 知之者不如好之者，好之者不如乐之者。

# Upgrade_Title
source: Upgrade to Pro
zh_cn: 升级正式版

# Upgrade_Primary
source: Enter license key
zh_cn: 输入激活码

# Upgrade_Later
source: Later
zh_cn: 稍后再说

# Upgrade_PaidHead
source: Paid features:
zh_cn: 付费功能：

# Upgrade_F1
source: • Unlimited custom domains (free: 3)
zh_cn: • 无限自定义域名（免费版最多 3 个）

# Upgrade_F2
source: • All 4 scenes customizable (free: 1)
zh_cn: • 4 个场景全部可自定义（免费版 1 个）

# Upgrade_F3
source: • Phone companion (scan stats + remote control)
zh_cn: • 手机伴侣（扫码看统计 + 远程控制）

# Upgrade_F4
source: • Data export (CSV/JSON)
zh_cn: • 数据导出（CSV/JSON）

# Upgrade_F5
source: • Advanced stats (peak hours + streak history)
zh_cn: • 进阶统计（高效时段 + 连续纪录）

# Upgrade_F6
source: • ADHD cooldown 20/30 min (free: 5/10/15)
zh_cn: • ADHD 缓冲期 20/30 分钟（免费版 5/10/15）

# Upgrade_How
source: \nTo buy: email yezhihua_yzh@163.com. License key sent after payment.
zh_cn: \n购买：发邮件到 yezhihua_yzh@163.com，付款后人工发送激活码。

# Activate_Placeholder
source: Paste the license key you received
zh_cn: 请输入购买后收到的激活码

# SceneWish_Work
source: Finish today's work
zh_cn: 完成今日工作任务

# SceneWish_Write
source: Write with a quiet mind
zh_cn: 专注写作，心无旁骛

# SceneWish_Study
source: Study deeply, understand thoroughly
zh_cn: 深度学习，理解透彻

# SceneWish_Meeting
source: Stay present in the meeting
zh_cn: 专注会议，高效沟通

# SceneWish_Default
source: Focus
zh_cn: 专注

# AppName_douyin
source: Douyin
zh_cn: 抖音

# AppName_kwai
source: Kwai
zh_cn: 快手

# AppName_bilibili
source: Bilibili
zh_cn: 哔哩哔哩

# AppName_huya
source: Huya
zh_cn: 虎牙

# AppName_douyu
source: Douyu
zh_cn: 斗鱼

# AppName_iqiyi
source: iQiyi
zh_cn: 爱奇艺

# AppName_youku
source: Youku
zh_cn: 优酷

# AppName_taobao
source: Taobao
zh_cn: 淘宝

# AppName_jd
source: JD
zh_cn: 京东

# AppName_pinduoduo
source: Pinduoduo
zh_cn: 拼多多

# AppName_WeChat
source: WeChat
zh_cn: 微信

# AppName_DingTalk
source: DingTalk
zh_cn: 钉钉

# AppName_WXWork
source: WeCom
zh_cn: 企业微信

# AppName_Lark
source: Lark
zh_cn: 飞书

# AppName_Feishu
source: Feishu
zh_cn: 飞书

# Lang_Label
source: Language
zh_cn: 语言

# Lang_ConfirmTitle
source: Switch language?
zh_cn: 切换语言？

# Lang_ConfirmContent
source: The app will restart. Current focus will end and website blocking will be cleared. Your site list (China / International) will not change — switch it on the Block page.
zh_cn: 应用将重启。当前专注会结束，网站屏蔽会先清掉。屏蔽名单（国内/国际）不会跟着变，要换请去屏蔽页。

# Lang_ConfirmPrimary
source: Restart
zh_cn: 重启

# MainPage_SettingsTooltip
source: Mode and language
zh_cn: 模式与语言

# Shield_HostsActive
source: Websites and apps are blocking now ({0} domains).
zh_cn: 网站和桌面应用正在拦截（{0} 个域名）。

# Shield_SavedPendingFocus
source: Saved ({0} domains). Websites apply when focus starts.
zh_cn: 已保存（{0} 个域名）。网站在开始专注后生效。

# Shield_SavedAppsOnly
source: Saved ({0} domains). Desktop apps will block. Websites need administrator.
zh_cn: 已保存（{0} 个域名）。桌面应用会拦。网站需要管理员。

# Notify_SaveNeedAdmin
source: Saved. Desktop apps will block. Websites need administrator.
zh_cn: 已保存。桌面应用会拦。网站需要管理员。

# Admin_ElevateHosts
source: Write website block to hosts
zh_cn: 把网站屏蔽写入 hosts

# Stats_HourTooltip
source: {0} — {1} min
zh_cn: {0} — {1} 分钟

# MainPage_Hotkeys
source: Shortcuts: Ctrl+Alt+F start/end · P pause · R 3-min break · S block page
zh_cn: 快捷键：Ctrl+Alt+F 开始/结束 · P 暂停 · R 休息3分钟 · S 屏蔽页

# Shield_CatalogLabel
source: Site list
zh_cn: 屏蔽名单

# Shield_CatalogIntl
source: International (YouTube / TikTok)
zh_cn: 国际站（YouTube / TikTok）

# Shield_CatalogChina
source: China (Douyin / Bilibili)
zh_cn: 国内站（抖音 / B站）

# Shield_CatalogHintEn
source: International list: YouTube, TikTok, Reddit. Switching UI language will not change this.
zh_cn: 国际名单：YouTube、TikTok、Reddit。切换界面语言不会改这份名单。

# Shield_CatalogHintZh
source: China list: Douyin, Bilibili, Weibo. Switching UI language will not change this.
zh_cn: 国内名单：抖音、B站、微博。切换界面语言不会改这份名单。

# Shield_CatalogConfirmTitle
source: Switch site list?
zh_cn: 切换屏蔽名单？

# Shield_CatalogConfirmContent
source: Checked categories stay. Sites and apps switch between China and International lists. UI language is unchanged.
zh_cn: 已勾选的分类不变。网站和应用会在国内/国际名单之间切换。界面语言不变。

# Shield_CatalogConfirmPrimary
source: Switch list
zh_cn: 切换名单

# Notify_CatalogEn
source: Switched to International site list.
zh_cn: 已切换到国际站名单。

# Notify_CatalogZh
source: Switched to China site list.
zh_cn: 已切换到国内站名单。

# Crash_Prompt
source: ZenFocus hit a problem and wrote a log. Restart if the app looks wrong. {0}
zh_cn: 禅净遇到问题，已写下日志。若界面异常请重启。 {0}

# Shield_Diagnose
source: Diagnose
zh_cn: 诊断

# Diag_Title
source: Diagnose
zh_cn: 诊断

# Diag_Yes
source: Yes
zh_cn: 是

# Diag_No
source: No
zh_cn: 否

# Diag_Elevated
source: Administrator: {0}
zh_cn: 管理员：{0}

# Diag_HostsWrite
source: Can write hosts: {0}
zh_cn: 能写 hosts：{0}

# Diag_Marker
source: Leftover website block in hosts: {0}
zh_cn: hosts 里有残留屏蔽：{0}

# Diag_Pre
source: Saved block config: {0}
zh_cn: 已保存屏蔽配置：{0}

# Diag_Catalog
source: Site list: {0}
zh_cn: 屏蔽名单：{0}

# Diag_WebsiteHosts
source: Websites: hosts can block new visits.
zh_cn: 网站：hosts 能拦新访问。

# Diag_WebsiteNeedAdmin
source: Websites: need administrator. Browser tabs stay open.
zh_cn: 网站：需要管理员。浏览器标签不会被关掉。

# Diag_App
source: Desktop apps: process name. Store apps: window title (the store host is never killed).
zh_cn: 桌面应用：按进程名。商店应用：按窗口标题（不会结束商店壳进程）。

# Diag_BrowserHosts
source: Browser: new visits fail. Already-open tabs may stay.
zh_cn: 浏览器：新访问会失败。已打开的标签可能还在。

# Diag_BrowserBubble
source: Browser: distraction bubble only. Tabs are not closed.
zh_cn: 浏览器：只出分心气泡，不会关标签。

# Diag_Log
source: Crash log: {0}
zh_cn: 崩溃日志：{0}
